Documents/ВрачебнаяКомиссия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВрачебнаяКомиссия</Name>
			<BasedOn>
				<xr:Item>Document.ЛистокНетрудоспособности</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьЦелиПроведенияВК</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистокНетрудоспособности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияНетрудоспособности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотренныеВопросы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Диагнозы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диагноз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньОбоснованности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНозологическойЕдиницы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассификацииДиагнозов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ПараметрыУчетнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПараметрыУчетнойПолитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШрифтКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШрифтРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретитьРучнойВводШККартыСкидокКлиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретитьРучнойВводШКСертификатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойВидОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчитыватьСкидкиПриВыбореКартыКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьХочуРаньшеВЗаявках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьОграничениеДоступаНаУровнеЗаписей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретитьАдминистраторуЗаписьКлиентаНеВСвойФилиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничиватьЧтениеФилиаломПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретитьЗаписьНаНерабочееВремяСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнятьОплатуПоСуммеДокументаАвтоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатыЗаписейЛистовОжидания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодыЗаписиЛистовОжидания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособОбработкиСчитыванияШкКлиентаВЖЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяСтрана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписыватьМатериалыСтационараСразу</Name>
					<Comment>Когда включена, списание потраченных в АРМ постой медсестры складких единиц делается в момент расхода. Когда выключено, предполагается ручной ввод документа "Списание товаров" на основании документа "Действия за сутки"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЭлектронныеПодписиЭМК</Name>
					<Comment>Перенесена в регистр НастройкиМедицинскогоУчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьОбменС1СБольничные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойМакетОформленияСКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойВидМедКартДляПрофОсмотров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедкартуДляПрофосмотраСоздаватьАвтоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедкартуДляПрофосмотраИскатьДругие025у</Name>
					<Comment>Искать другие медкарты других видов 025/у для подстановки в прохождение медосмотра</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоискКлиентаПоПодстрокеПоказыватьСДатойРождения</Name>
					<Comment>Только в документах с нашим запрограммированным поиском по подстроке</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтозаполнениеПолучателяИИНН</Name>
					<Comment>Подставляет по выбранному клиенту данные о ФИО и ИНН в поля документов, из которых фискализируются кассовые чеки.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретитьЗаписьКлиентаНаДваПосещенияОдновременно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураОжиданияКлиента</Name>
					<Comment>Для автопоиска времени записи клиента - для интервалов ожидания клиента между услугами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборВремениЗаписиМаксВремяОжидания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредлагатьСобиратьЗаявкиЗаДеньВДокументПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяСтатьяЗатратЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьКартыСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВестиУчетТорговойДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяОбработкаSMSРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойВидДУЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоподстановкаИмениОтчества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтозаполнениеНаправившегоВрача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормаУчастияДляНаправившегоВрача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнакПодтвержденнойЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодОбновленияНепросмотренныхДокументовССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьАвтоПодборКлиентовПоИмениИФамилии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьШтрихкодированиеСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокЖизниЛида</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьАвтоподборКлиентовПоКоду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказыватьСопутствующиеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РежимРазметкиКлиентскойОбластиШаблоновПриема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяНастройкаОбменаССайтом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусыЗапретОтрицательныхОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьПродажуМаркированныхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедосмотрыПравилоОпределенияНезавершивших</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЭлектронноПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекКММВыводитьQRКодНаДисплейПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекККМВариантПечатиДополнительнойРасшифровкиПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтролироватьЗаполнениеШКМаркированногоТовараПриПродаже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетФирмыВидОплатыИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресСервисаНСПК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КалендарьЖурналаЗаписиРастягивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛокальнуюПроверкуМаркировкиНаККТИспользовать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВрачебнаяКомиссия/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	#Область ЭлектронныеПодписи
	ИспользуютсяЭП = ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК();
	Если ИспользуютсяЭП И Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
		УстановитьДоступностьВидимостьПоЭП();
	КонецЕсли;
	ПараметрыФО = Новый Структура("ПараметрУчетнаяПолитикаРасширенная", Перечисления.ПараметрыУчетнойПолитики.ИспользоватьЭлектронныеПодписиЭМК);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	#КонецОбласти
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинЗдрава");
		ЭтаФорма.Элементы.Цель.ОграничениеТипа = ОписаниеТипа;
		Объект.Цель = ОписаниеТипа.ПривестиЗначение();
		
		Если Не ЗначениеЗаполнено(Объект.Цель) 
			И Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) 
		Тогда
			Объект.Цель = Документы.ВрачебнаяКомиссия.ПолучитьЭлементИныеЦели();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	ОбновитьВидимостьДанныхЛН();
	
	Если ЗначениеЗаполнено(Объект.Заключение) Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаключение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьПодписи"
		И Параметр = Объект.Ссылка
	Тогда
		ЭтотОбъект.Прочитать();
		ОбновитьДанныеПослеПодписания();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокПодписей"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьСписокПодписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзПриема(Команда)
	ОткрытьФорму("Документ.Прием.Форма.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ЗаполнитьДиагнозыИзДругогоПриемаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзОснования(Команда)
	ЗаполнитьДиагнозыИзОснованияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДиагнозыПриАктивизацииСтроки(Элемент)
	ОбновитьЗаголовокОписания();	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозыДиагнозПриИзменении(Элемент)
	ОбновитьЗаголовокОписания();
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ОбновитьВидимостьДанныхЛН();
		Ответ = Вопрос(НСтр("ru='Перезаполнить данные?'"), РежимДиалогаВопрос.ДаНет,0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда     
			ПерезаполнитьНаОсновании();   
	    КонецЕсли;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьВидимостьДанныхЛН(Истина);
КонецПроцедуры
 
&НаКлиенте
Процедура СтрокаЛНПриИзменении(Элемент)
	ЗаполнитьДанныеИзЛН(Объект.СтрокаЛН,Объект.Основание);
	ОбновитьЗаключение();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Объект.МедицинскаяКарта = МедицинскаяДеятельность.ПолучитьОсновнуюМедКартуПациента(Объект.Клиент,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЗаголовокОписания()
	Если Элементы.Диагнозы.ТекущиеДанные <> Неопределено Тогда
		Элементы.ЗаголовокДиагноз.Заголовок = НСтр("ru='Строка №'") + Элементы.Диагнозы.ТекущиеДанные.НомерСтроки + ": " + Элементы.Диагнозы.ТекущиеДанные.Диагноз;
		Элементы.ГруппаОписание.Доступность = Истина;
	Иначе          
		Элементы.ЗаголовокДиагноз.Заголовок = "";	
		Элементы.ГруппаОписание.Доступность = Ложь;
	КонецЕсли; 		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаключение() 
	Если ЗначениеЗаполнено(Объект.ДатаНачалаНетрудоспособности) Или ЗначениеЗаполнено(Объект.ДатаОкончанияНетрудоспособности) Тогда
		Ответ = Вопрос(НСтр("ru='Обновить заключение?'"), РежимДиалогаВопрос.ДаНет,0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда     
			Объект.Заключение = "Продлить лист нетрудоспособности с " 
								+ Формат(Объект.ДатаНачалаНетрудоспособности,"ДФ=dd.MM.yyyy") + " по " 
								+ Формат(Объект.ДатаОкончанияНетрудоспособности,"ДФ=dd.MM.yyyy");   
	    КонецЕсли;		
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИзЛН(СтрокаЛН, СсылкаЛН)
	Если СтрокаЛН = 1 Тогда
		Объект.ДатаНачалаНетрудоспособности = СсылкаЛН.Запись1ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = СсылкаЛН.Запись1ДатаОкончания;
		Объект.ПредседательКомиссии = СсылкаЛН.Запись1ПредседательВК;		
		Объект.СоставКомиссии.Очистить();
		Если Объект.ПредседательКомиссии<>СсылкаЛН.Запись1Врач Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = СсылкаЛН.Запись1Врач;
		КонецЕсли; 
	ИначеЕсли СтрокаЛН = 2 Тогда 
		Объект.ДатаНачалаНетрудоспособности = СсылкаЛН.Запись2ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = СсылкаЛН.Запись2ДатаОкончания;
		Объект.ПредседательКомиссии = СсылкаЛН.Запись2ПредседательВК;
		Объект.СоставКомиссии.Очистить();
		Если Объект.ПредседательКомиссии<>СсылкаЛН.Запись2Врач Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = СсылкаЛН.Запись2Врач;
		КонецЕсли; 	
	ИначеЕсли СтрокаЛН = 3 Тогда 
		Объект.ДатаНачалаНетрудоспособности = СсылкаЛН.Запись3ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = СсылкаЛН.Запись3ДатаОкончания;
		Объект.ПредседательКомиссии = СсылкаЛН.Запись3ПредседательВК;
		Объект.СоставКомиссии.Очистить();
		Если Объект.ПредседательКомиссии<>СсылкаЛН.Запись3Врач Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = СсылкаЛН.Запись3Врач;
		КонецЕсли; 	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаОсновании()
	СсылкаОснование = Объект.Основание;       
	Объект.Диагнозы.Очистить();
	Объект.СоставКомиссии.Очистить();
	Если ТипЗнч(СсылкаОснование) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
		// Заполнение шапки
		Объект.Клиент = СсылкаОснование.Клиент;
		Объект.Ответственный = СсылкаОснование.Ответственный;
		Объект.Основание = СсылкаОснование.Ссылка;
		Объект.МедицинскаяКарта = СсылкаОснование.МедицинскаяКарта;

		// Данные ЛН
		ДанныеЛН = Документы.ЛистокНетрудоспособности.ПолучитьПоследниееДанныеЛН(Объект.Основание);	
		Объект.СтрокаЛН = ДанныеЛН.НомерСтроки;
		Объект.ДатаНачалаНетрудоспособности = ДанныеЛН.ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = ДанныеЛН.ДатаОкончания;
		Объект.ПредседательКомиссии = ДанныеЛН.ПредседательВК;
		Заключение = НСтр("ru='Продлить лист нетрудоспособности с '") 
					+ Формат(Объект.ДатаНачалаНетрудоспособности,"ДФ=dd.MM.yyyy") + " по "
					+ Формат(Объект.ДатаОкончанияНетрудоспособности,"ДФ=dd.MM.yyyy");
		
		// Состав комиссии
		Объект.СоставКомиссии.Очистить();
		ВрачЛН = ДанныеЛН.Врач;
		Если ЗначениеЗаполнено(ВрачЛН) И Объект.ПредседательКомиссии<>ВрачЛН Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = ВрачЛН;	
		КонецЕсли;		
		
		// Диагноз
		Объект.Диагнозы.Очистить();	
		СтрокаДиагноза = Объект.Диагнозы.Добавить();
		СтрокаДиагноза.Диагноз = СсылкаОснование.ДиагнозПоМКБ10;
	ИначеЕсли ТипЗнч(СсылкаОснование) = Тип("ДокументСсылка.Прием") Тогда
		// Заполнение шапки
		Объект.Клиент = СсылкаОснование.Клиент;
		Объект.Основание = СсылкаОснование.Ссылка;
		Объект.МедицинскаяКарта = СсылкаОснование.МедицинскаяКарта;
		
		// Состав комиссии
		Объект.СоставКомиссии.Очистить();
		СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
		СтрокаСотрудника.Сотрудник = СсылкаОснование.Врач;
		
		// Диагнозы
		Объект.Диагнозы.Очистить();
		Для каждого СтрокаДиагноза Из СсылкаОснование.Диагнозы Цикл
			НоваяСтрока = Объект.Диагнозы.Добавить();
			НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
			НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
			НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
		КонецЦикла; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзДругогоПриемаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьДиагнозамиИзПриема(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиагнозамиИзПриема(Прием)
	Для каждого СтрокаДиагноза Из Прием.Диагнозы Цикл
		НоваяСтрока = Объект.Диагнозы.Добавить();
		НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
		НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
		НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДанныхЛН(Скрыть = Ложь)
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЛистокНетрудоспособности") И Не Скрыть Тогда 
		Элементы.СтрокаЛН.Видимость = Истина;	
		Элементы.ПериодНетрудоспособности.Видимость = Истина;
	Иначе
		Элементы.СтрокаЛН.Видимость = Ложь;
		Элементы.ПериодНетрудоспособности.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиагнозыИзОснованияНаСервере()
	ОбъектОснование = Объект.Основание;
	Если ТипЗнч(ОбъектОснование) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
		СтрокаДиагноза = Объект.Диагнозы.Добавить();
		СтрокаДиагноза.Диагноз = ОбъектОснование.ДиагнозПоМКБ10;
	ИначеЕсли ТипЗнч(ОбъектОснование) = Тип("ДокументСсылка.Прием") Тогда	
		Для каждого СтрокаДиагноза Из ОбъектОснование.Диагнозы Цикл
			НоваяСтрока = Объект.Диагнозы.Добавить();
			НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
			НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
			НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
		КонецЦикла; 
	КонецЕсли;	 
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписи

#Область ЭлектронныеПодписиКоманды

&НаКлиенте
Процедура ПодписатьВсе(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, , , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодписаниюЭМД(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Истина, , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписей()
	
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписей(Объект.Ссылка, УникальныйИдентификатор, Элементы.ГруппаЭП, ЭлектронныеПодписи,, СводкаHTML);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПодписания()
	
	ОбновитьСписокПодписей();
	УстановитьДоступностьВидимостьПоЭП();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокиТекстаОшибки = Новый Массив;
	СтрокиТекстаОшибки.Добавить(НСтр("ru='Некоторые подписи не прошли проверку:'"));
	Для Каждого Подпись Из ЭлектронныеПодписи Цикл
		Если ЗначениеЗаполнено(Подпись.ОписаниеОшибки) Тогда
			СтрокиТекстаОшибки.Добавить(СтрШаблон(НСтр("ru='""%1"" от %2 по причине ""%3""'"), Подпись.КомуВыданСертификат, Строка(Подпись.ДатаПодписи), Подпись.ОписаниеОшибки));
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиТекстаОшибки.Количество() > 1 Тогда
		ПоказатьПредупреждение(, СтрСоединить(СтрокиТекстаОшибки, Символы.ПС));
	ИначеЕсли Объект.ПодписанЭП Тогда
		ПоказатьПредупреждение(, НСтр("ru='Все подписи прошли проверку'"));
	КонецЕсли;
	
	ПрочитатьУстановитьДоступностьПолейЗаполнитьПодписи();
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиУправлениеДоступностьюПолей

&НаСервере
Процедура УстановитьДоступностьВидимостьПоЭП()
	
	Элементы.ГруппаЭП.Видимость = ИспользуютсяЭП;
	
	Если ИспользуютсяЭП Тогда
		Элементы.ГруппаДокумента.ТолькоПросмотр = Объект.ПодписанЭП;
		УстановитьДоступностьПодчиненныхКнопок(Элементы.Диагнозы.КоманднаяПанель, Объект.ПодписанЭП);
		РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "КнопкаФилиал", "Доступность", Не Объект.ПодписанЭП);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПодчиненныхКнопок(Родитель, ИзмененияЗапрещены)
	
	Для Каждого ПодчиненныйЭлемент Из Родитель.ПодчиненныеЭлементы Цикл
		ПодчиненныйЭлемент.Доступность = Не ИзмененияЗапрещены;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьУстановитьДоступностьПолейЗаполнитьПодписи()
	
	Прочитать();
	УстановитьДоступностьВидимостьПоЭП();
	ОбновитьСписокПодписей();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
